---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FixtureUnits
source: html/414e4cbd-39bd-f6ec-7ffd-1b9ac67f14a0.htm
---
# Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FixtureUnits Property

The fixture units of the pipe.

## Syntax (C#)
```csharp
public double FixtureUnits { get; }
```